In [1]:
#Tratamiento de valores nulos o sin valor
import numpy as np
import pandas as pd

In [4]:
dictionary = {'A': [4,5,np.nan], 'B': [6,1,5], 'C': [np.nan, 4, np.nan]} 
dataframe = pd.DataFrame(dictionary) #Crear un dataframe a partir de un diccionario con un valor null "np.nan"

In [5]:
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [8]:
dataframe.dropna() #Borrar filas con valores nulos

     A  B    C
1  5.0  1  4.0

In [25]:
dataframe.dropna(axis=1) #Borrar columnas con valores nulos

   B
0  6
1  1
2  5

In [26]:
dataframe2

   B
0  6
1  1
2  5

In [27]:
dataframe.fillna(value=100) #Rellenar los valores nulos con 100

       A  B      C
0    4.0  6  100.0
1    5.0  1    4.0
2  100.0  5  100.0

In [31]:
#Rellenar los valores nulos con medio

In [32]:
mean_value = dataframe.mean() 
mean_value

A    4.5
B    4.0
C    4.0
dtype: float64

In [50]:
dataframe.fillna(value=mean_value)

     A  B    C
0  4.0  6  4.0
1  5.0  1  4.0
2  4.5  5  4.0